COMMENT *

; 01.03.2025 Головейко Александр
;
; Пример Hello World на ассемблере для микрокомпьтера "Электроника МК85"
;
; Это файл можно скомпилировать и открыть в калькуляторе командой
; mk85m.exe -asmfn "helloworld.asm" -romfn "helloworld.rom"
; где
; -asmfn "helloworld.asm" файл для компиляции
; -romfn "helloworld.rom" выходной bin файл ROM
;
; Для получения дополнительной справки выполни mk85m.exe -help
;
; Версию эмулятора микрокомпьтера "Электроника МК85" для работы с коммандной строкой ищи на
; https://github.com/MatrexAl/mk85emsl

*




; Векторы прерываний
0000:	.dw	0110,00E0	; Сброс
0004:	.dw	0110,00E0	; Ошибка доступа к памяти
0008:	.dw	0110,00E0	; Ошибка выполения кода
00FC:	.db 00, 00, 00, 00, 55, 55, 55, 55, 55, 55; ОСТОРОЖНО!! В этом диапазоне не должно быть кода (Неизвестно почему. Возможно системные флаги?)

; Сброс
.ORG 0110
               mov    #812C,sp        ;Магическая команда, без нее не раработает
               mov    #0041,8264      ;Вывод строки без прокрутки
               mov    lStrHW,r4       ;Ссылка на строку
               jsr    pc,lPrintR4     ;Покажем строку
lDeadLoop:	   jmp    lDeadLoop       ;Зациклимся на одном месте	


lPrintR4:      movb   (r4)+,r0        ; Печать строки с адреса в r4. Символ по адресу в r4 в регистр r0
               beq    lPrintExitR4    ;Если символ 0 (конец строки) - выход
               jsr    pc,lPrintR0	  ;Покажем символ с регистра r0
               br     lPrintR4
lPrintExitR4:  rts    pc

lClearScreen:  mov    r0,-(sp)        ; Очистим дисплей
               mov    #80,r0
lCLS0:	       inc    r0              ; Цикл очистки позиции
lCLS1:         clrb   7F80(r0)        ; Цикл очистки линии у символа
               clrb   (r0)+
               bit    #7,r0
               bne    lCLS1
               cmp    r0,#E0
               bcs    lCLS0
               movb   #C,(r0)         ;Спраячем курсор
               mov    (sp)+,r0
               bisb   #1,8264         ;Длинная задержка перед прокруткой
               clrb   8269            ;Позиция курсора
               rts    pc

lPrintR0:	   mov    r2,-(sp)        ; Вывод символа из регистра r0
               tstb   8264            ;does the screen need to be cleared?
               bmi    lPr0Det         ;branch if not
               jsr    pc,lClearScreen ;clear screen
               bisb   #80,8264
lPr0Det:	   mov    #B,r2           ; determine the cursor position from which scrolling is needed
               tstb	8265
               bmi	lPr0Det1
               inc	r2
lPr0Det1:      cmpb	8269,r2           ;cursor position
               bcs	lPrinting         ;branch if scrolling not needed yet
               bitb	#40,8264          ;delay between scrolling?
lPrinting:     jsr	pc,lPrintingCh    ;print character r0
               incb	8269              ;cursor position
               mov	(sp)+,r2
               rts	pc		
lPrintingCh:   bic	#FF00,r0          ; print character r0 at position 8269
               dec	r0                ;character codes start from 1
               mov	r0,-(sp)
               asl	r0
               asl	r0
               asl	r0
               sub	(sp)+,r0	      ;r0 = 7*r0
			   add	lFontTable,r0     ;font table, each entry occupies 7 bytes
               cmp	#3D49,r0          ;code 0x60 - user defined character
               bne	label0A16
               mov	#81AD,r0          ;user defined character
label0A16:	   movb	8269,r1           ;cursor position
               asl	r1
               asl	r1
               asl	r1
               add	#8001,r1          ;address in the display memory
label0A24:	   movb	(r0),8080(r1)     ;copy 7 rows to LCD RAM and display memory, send pattern to LCD RAM
               movb	(r0)+,(r1)+       ;write pattern to display memory
               bit	#7,r1
               bne	label0A24
               rts	pc

; Строки
lStrHW:        .asciz "Привет мир!"

; font table, character codes 0x01-0xBF, 7 bytes for each character
lFontTable:    .db 00, 01, 03, 07,  0F, 1F, 00, 00,  10, 18, 1C, 1E,  1F, 00, 00, 1F
               .db 1E, 1C, 18, 10,  00, 00, 1F, 0F,  07, 03, 01, 00,  00, 1F, 0E, 04
               .db 0E, 1F, 00, 00,  11, 1B, 1F, 1B,  11, 00, 08, 04,  04, 02, 04, 04
               .db 08, 02, 04, 04,  08, 04, 04, 02,  00, 16, 09, 15,  12, 0D, 00, 00
               .db 00, 00, 00, 00,  00, 15, 00, 0E,  11, 11, 11, 0E,  00, 1F, 11, 02
               .db 04, 02, 11, 1F,  06, 09, 09, 06,  00, 00, 00, 00,  00, 04, 0A, 1F
               .db 00, 00, 00, 00,  00, 00, 00, 00,  1F, 00, 11, 0A,  04, 0A, 11, 00
               .db 00, 04, 00, 1F,  00, 04, 00, 04,  0E, 1F, 1F, 15,  04, 0E, 00, 0A
               .db 1F, 1F, 0E, 04,  00, 00, 04, 0E,  1F, 0E, 04, 00,  04, 0E, 04, 1F
               .db 1F, 04, 0E, 00,  00, 09, 09, 17,  01, 01, 0E, 11,  11, 11, 0A, 0A
               .db 1B, 04, 04, 04,  04, 15, 0E, 04,  00, 04, 02, 1F,  02, 04, 00, 00
               .db 04, 08, 1F, 08,  04, 00, 11, 0A,  1F, 04, 1F, 04,  04, 00, 1F, 11
               .db 11, 11, 1F, 00,  00, 00, 00, 06,  06, 00, 00, 03,  02, 02, 0E, 12
               .db 12, 0E, 00, 00,  03, 02, 0E, 12,  0E, 00, 00, 00,  00, 00, 00, 00
               .db 04, 04, 04, 04,  04, 00, 04, 0A,  0A, 0A, 00, 00,  00, 00, 0A, 0A
               .db 1F, 0A, 1F, 0A,  0A, 04, 1E, 05,  0E, 14, 0F, 04,  03, 13, 08, 04
               .db 02, 19, 18, 06,  09, 05, 02, 15,  09, 16, 06, 04,  02, 00, 00, 00
               .db 00, 08, 04, 02,  02, 02, 04, 08,  02, 04, 08, 08,  08, 04, 02, 00
               .db 04, 15, 0E, 15,  04, 00, 00, 04,  04, 1F, 04, 04,  00, 00, 00, 00
               .db 00, 06, 04, 02,  00, 00, 00, 1F,  00, 00, 00, 00,  00, 00, 00, 00
               .db 06, 06, 00, 10,  08, 04, 02, 01,  00, 0E, 11, 19,  15, 13, 11, 0E
               .db 04, 06, 04, 04,  04, 04, 0E, 0E,  11, 10, 08, 04,  02, 1F, 1F, 08
               .db 04, 08, 10, 11,  0E, 08, 0C, 0A,  09, 1F, 08, 08,  1F, 01, 0F, 10
               .db 10, 11, 0E, 0C,  02, 01, 0F, 11,  11, 0E, 1F, 10,  08, 04, 04, 04
               .db 04, 0E, 11, 11,  0E, 11, 11, 0E,  0E, 11, 11, 1E,  10, 08, 06, 00
               .db 06, 06, 00, 06,  06, 00, 00, 06,  06, 00, 06, 04,  02, 08, 04, 02
               .db 01, 02, 04, 08,  00, 00, 1F, 00,  1F, 00, 00, 02,  04, 08, 10, 08
               .db 04, 02, 0E, 11,  10, 08, 04, 00,  04, 00, 0F, 10,  16, 15, 15, 0E
               .db 0E, 11, 11, 1F,  11, 11, 11, 0F,  11, 11, 0F, 11,  11, 0F, 0E, 11
               .db 01, 01, 01, 11,  0E, 07, 09, 11,  11, 11, 09, 07,  1F, 01, 01, 0F
               .db 01, 01, 1F, 1F,  01, 01, 0F, 01,  01, 01, 0E, 11,  01, 1D, 11, 11
               .db 1E, 11, 11, 11,  1F, 11, 11, 11,  0E, 04, 04, 04,  04, 04, 0E, 1C
               .db 08, 08, 08, 08,  09, 06, 11, 09,  05, 03, 05, 09,  11, 01, 01, 01
               .db 01, 01, 01, 1F,  11, 1B, 15, 15,  11, 11, 11, 11,  11, 13, 15, 19
               .db 11, 11, 0E, 11,  11, 11, 11, 11,  0E, 0F, 11, 11,  0F, 01, 01, 01
               .db 0E, 11, 11, 11,  15, 09, 16, 0F,  11, 11, 0F, 05,  09, 11, 1E, 01
               .db 01, 0E, 10, 10,  0F, 1F, 04, 04,  04, 04, 04, 04,  11, 11, 11, 11
               .db 11, 11, 0E, 11,  11, 11, 11, 11,  0A, 04, 11, 11,  11, 15, 15, 1B
               .db 11, 11, 11, 0A,  04, 0A, 11, 11,  11, 11, 0A, 04,  04, 04, 04, 1F
               .db 10, 08, 04, 02,  01, 1F, 0E, 02,  02, 02, 02, 02,  0E, 00, 02, 1F
               .db 04, 1F, 08, 00,  0E, 08, 08, 08,  08, 08, 0E, 04,  0E, 15, 04, 04
               .db 04, 04, 00, 08,  04, 02, 1F, 00,  1F, 00, 00, 00,  00, 00, 00, 00
               .db 00, 00, 0E, 10,  1E, 11, 1E, 01,  01, 0D, 13, 11,  11, 0E, 00, 00
               .db 0E, 01, 01, 11,  0E, 10, 10, 16,  19, 11, 11, 0E,  00, 00, 0E, 11
               .db 1F, 01, 0E, 08,  14, 04, 0E, 04,  04, 04, 00, 00,  1E, 11, 1E, 10
               .db 0E, 01, 01, 0D,  13, 11, 11, 11,  04, 00, 06, 04,  04, 04, 0E, 08
               .db 00, 08, 08, 08,  09, 06, 02, 02,  12, 0A, 06, 0A,  12, 06, 04, 04
               .db 04, 04, 04, 0E,  00, 00, 0B, 15,  15, 15, 15, 00,  00, 0D, 13, 11
               .db 11, 11, 00, 00,  0E, 11, 11, 11,  0E, 00, 00, 0F,  11, 0F, 01, 01
               .db 00, 00, 1E, 11,  1E, 10, 10, 00,  00, 1A, 06, 02,  02, 02, 00, 00
               .db 1E, 01, 0E, 10,  0F, 00, 04, 0E,  04, 04, 14, 08,  00, 00, 11, 11
               .db 11, 19, 16, 00,  00, 11, 11, 11,  0A, 04, 00, 00,  11, 11, 15, 15
               .db 0A, 00, 00, 13,  0C, 04, 06, 19,  00, 00, 11, 12,  0C, 04, 03, 00
               .db 00, 1F, 08, 04,  02, 1F, 00, 00,  0F, 01, 07, 01,  0F, 00, 00, 1F
               .db 0A, 0A, 0A, 19,  1C, 00, 07, 01,  07, 01, 07, 00,  02, 04, 08, 1F
               .db 00, 1F, 1F, 1F,  1F, 1F, 1F, 1F,  1F, 00, 00, 09,  15, 17, 15, 09
               .db 00, 00, 0E, 10,  1E, 11, 1E, 1E,  01, 0E, 11, 11,  11, 0E, 00, 00
               .db 09, 09, 09, 1F,  10, 0E, 10, 1E,  11, 11, 11, 0E,  00, 00, 0E, 11
               .db 1F, 01, 0E, 00,  04, 0E, 15, 15,  0E, 04, 00, 00,  0E, 10, 0E, 01
               .db 0E, 00, 00, 13,  0C, 04, 06, 19,  00, 00, 11, 11,  11, 19, 16, 00
               .db 00, 15, 11, 11,  19, 16, 00, 00,  12, 0A, 06, 0A,  12, 00, 00, 1C
               .db 12, 12, 12, 11,  00, 00, 11, 1B,  15, 11, 11, 00,  00, 11, 11, 1F
               .db 11, 11, 00, 00,  0E, 11, 11, 11,  0E, 00, 00, 0D,  13, 11, 11, 11
               .db 00, 00, 1E, 11,  1E, 14, 13, 00,  00, 0F, 11, 0F,  01, 01, 00, 00
               .db 0E, 11, 01, 01,  0E, 00, 00, 0B,  15, 15, 15, 15,  00, 00, 11, 12
               .db 0C, 04, 03, 00,  00, 15, 15, 0E,  15, 15, 03, 05,  05, 0F, 11, 11
               .db 0E, 00, 00, 01,  01, 0F, 11, 0F,  00, 00, 11, 11,  13, 15, 17, 00
               .db 00, 0E, 10, 0C,  11, 0E, 00, 00,  15, 15, 15, 15,  1F, 00, 00, 0F
               .db 10, 1E, 10, 0F,  00, 00, 15, 15,  15, 1F, 10, 00,  00, 11, 11, 1E
               .db 10, 10, 00, 0A,  0E, 11, 1F, 01,  0E, 09, 15, 15,  17, 15, 15, 09
               .db 1C, 12, 11, 1F,  11, 11, 11, 1F,  01, 01, 0F, 11,  11, 0F, 09, 09
               .db 09, 09, 09, 1F,  10, 0C, 0A, 0A,  0A, 0A, 1F, 11,  1F, 01, 01, 0F
               .db 01, 01, 1F, 04,  0E, 15, 15, 15,  0E, 04, 1F, 01,  01, 01, 01, 01
               .db 01, 11, 11, 0A,  04, 0A, 11, 11,  11, 11, 19, 15,  13, 11, 11, 15
               .db 11, 19, 15, 13,  11, 11, 11, 09,  05, 03, 05, 09,  11, 1C, 12, 11
               .db 11, 11, 11, 11,  11, 1B, 15, 15,  11, 11, 11, 11,  11, 11, 1F, 11
               .db 11, 11, 0E, 11,  11, 11, 11, 11,  0E, 1F, 11, 11,  11, 11, 11, 11
               .db 1E, 11, 11, 1E,  14, 12, 11, 0F,  11, 11, 0F, 01,  01, 01, 0E, 11
               .db 01, 01, 01, 11,  0E, 1F, 04, 04,  04, 04, 04, 04,  11, 11, 11, 1E
               .db 10, 10, 0F, 15,  15, 0E, 04, 0E,  15, 15, 0F, 11,  11, 0F, 11, 11
               .db 0F, 01, 01, 01,  0F, 11, 11, 0F,  11, 11, 11, 13,  15, 15, 17, 0E
               .db 11, 10, 0C, 10,  11, 0E, 15, 15,  15, 15, 15, 15,  1F, 0E, 11, 10
               .db 1E, 10, 11, 0E,  15, 15, 15, 15,  15, 1F, 10, 11,  11, 11, 1E, 10
               .db 10, 10, 0A, 1F,  01, 07, 01, 01,  1F